/*
Задача 27: Напишите программу, которая принимает на вход число 
и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12
*/ 


/// тут ваще мимо

Console.Write("Введите число:");
int N = Convert.ToInt32(Console.ReadLine());
int sum = 0;
int[] digits;

for (int i = 1; i < N*10; i++)
{
    int 

}

Console.WriteLine(sum);